<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/c36c9cca-8124-4a4c-a6a9-171f6b7dd41f/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.monitoring.grafana_data_source.prometheus has been deleted
  - resource "grafana_data_source" "prometheus" {
        id                 = "137"
        name               = "walletconnect-eu-central-1-prod-history-amp"
      - uid                = "cIjCUqf4k" -> null
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_prometheus_workspace.prometheus will be updated in-place
  ~ resource "aws_prometheus_workspace" "prometheus" {
        id                  = "ws-29641597-9b6a-44dd-9f05-e48a94e51f9c"
      ~ tags                = {
          - "application" = "history" -> null
        }
      ~ tags_all            = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place
  ~ resource "aws_acm_certificate" "domain_certificate" {
        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/5030302f-c887-4743-909b-76e57f844a3c"
      ~ tags                      = {
          - "application" = "history" -> null
        }
      ~ tags_all                  = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {
        id                = "walletconnect-prod-history_logs"
        name              = "walletconnect-prod-history_logs"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "app_cluster" {
        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/walletconnect-prod-history"
        name               = "walletconnect-prod-history"
      ~ tags               = {
          - "application" = "history" -> null
        }
      ~ tags_all           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-prod-history/walletconnect-prod-history-service"
        name                               = "walletconnect-prod-history-service"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:12" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:12" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "walletconnect-prod-history" -> (known after apply)
      ~ revision                 = 12 -> (known after apply)
      - tags                     = {
          - "application" = "history"
        } -> null
      ~ tags_all                 = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_iam_policy.otel will be updated in-place
  ~ resource "aws_iam_policy" "otel" {
        id        = "arn:aws:iam::898587786287:policy/walletconnect-prod-history-otel"
        name      = "walletconnect-prod-history-otel"
      ~ tags      = {
          - "application" = "history" -> null
        }
      ~ tags_all  = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_execution_role" {
        id                    = "walletconnect-prod-history-ecs-task-execution-role"
        name                  = "walletconnect-prod-history-ecs-task-execution-role"
      ~ tags                  = {
          - "application" = "history" -> null
        }
      ~ tags_all              = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.ecs.aws_lb.application_load_balancer will be updated in-place
  ~ resource "aws_lb" "application_load_balancer" {
        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/walletconnect-prod-history/c55de72490c4a039"
        name                             = "walletconnect-prod-history"
      ~ tags                             = {
          - "application" = "history" -> null
        }
      ~ tags_all                         = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_lb_listener.listener will be updated in-place
  ~ resource "aws_lb_listener" "listener" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-prod-history/c55de72490c4a039/e44bb46ef00b8a6a"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_listener.listener-http will be updated in-place
  ~ resource "aws_lb_listener" "listener-http" {
        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-prod-history/c55de72490c4a039/b41fd393390c353e"
      ~ tags              = {
          - "application" = "history" -> null
        }
      ~ tags_all          = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ecs.aws_lb_target_group.target_group will be updated in-place
  ~ resource "aws_lb_target_group" "target_group" {
        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/walletconnect-prod-history/78b4a2bb7695306a"
        name                               = "walletconnect-prod-history"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ecs.aws_security_group.app_ingress will be updated in-place
  ~ resource "aws_security_group" "app_ingress" {
        id                     = "sg-0b43a03722dabc0da"
        name                   = "walletconnect-prod-history-ingress-to-app"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.ecs.aws_security_group.lb_ingress will be updated in-place
  ~ resource "aws_security_group" "lb_ingress" {
        id                     = "sg-0b720bcf5e84babae"
        name                   = "walletconnect-prod-history-lb-ingress"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_cluster.docdb_primary will be updated in-place
  ~ resource "aws_docdb_cluster" "docdb_primary" {
        id                              = "walletconnect-prod-history-history-db-primary"
      ~ tags                            = {
          - "application" = "history" -> null
        }
      ~ tags_all                        = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place
  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {
        id                           = "walletconnect-prod-history-history-db-primary-instance-0"
      ~ tags                         = {
          - "application" = "history" -> null
        }
      ~ tags_all                     = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (20 unchanged attributes hidden)
    }

  # module.history_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place
  ~ resource "aws_docdb_subnet_group" "private_subnets" {
        id          = "walletconnect-prod-history-history-db-private-subnet-group"
        name        = "walletconnect-prod-history-history-db-private-subnet-group"
      ~ tags        = {
          - "application" = "history" -> null
        }
      ~ tags_all    = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.history_docdb.aws_kms_key.docdb_encryption will be updated in-place
  ~ resource "aws_kms_key" "docdb_encryption" {
        id                                 = "2376630b-ad46-4e6d-900c-a03c76e6eb84"
      ~ tags                               = {
          - "application" = "history" -> null
        }
      ~ tags_all                           = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)
    }

  # module.history_docdb.aws_secretsmanager_secret.master_password will be updated in-place
  ~ resource "aws_secretsmanager_secret" "master_password" {
        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:walletconnect-prod-history-history-db-master-password-kQ0JMy"
        name                           = "walletconnect-prod-history-history-db-master-password"
      ~ tags                           = {
          - "application" = "history" -> null
        }
      ~ tags_all                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.history_docdb.aws_security_group.service_security_group will be updated in-place
  ~ resource "aws_security_group" "service_security_group" {
        id                     = "sg-0b20ecc25cab21283"
        name                   = "walletconnect-prod-history-history-db-service"
      ~ tags                   = {
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.monitoring.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "dashboard_title" = "prod - history"
          + "dashboard_uid"   = "prod-history"
          + "prometheus_uid"  = (known after apply)
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.monitoring.grafana_dashboard.main will be created
  + resource "grafana_dashboard" "main" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.monitoring.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-prod-history-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.monitoring.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + manageAlerts  = false
              + sigV4Auth     = true
              + sigV4AuthType = "ec2_iam_role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "walletconnect-eu-central-1-prod-history-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/"
    }

  # module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-09bb771bb1760d7fc"
      ~ tags                   = {
            "Name"        = "prod-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-046a3d3232d8b3613"
      ~ tags                   = {
            "Name"        = "prod-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-024a8de0536ce595b"
        name                   = "default"
      ~ tags                   = {
            "Name"        = "prod-history-default"
          - "application" = "history" -> null
        }
      ~ tags_all               = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0e4c3e984dd851e98"
      ~ tags                 = {
            "Name"        = "prod-history-eu-central-1a"
          - "application" = "history" -> null
        }
      ~ tags_all             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-092684c3f9ff22731"
      ~ tags     = {
            "Name"        = "prod-history"
          - "application" = "history" -> null
        }
      ~ tags_all = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                   = "nat-013632d6acdc19f3c"
      ~ tags                 = {
            "Name"        = "prod-history-eu-central-1a"
          - "application" = "history" -> null
        }
      ~ tags_all             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-009d6aead2afe5310"
      ~ tags             = {
            "Name"        = "prod-history-private"
          - "application" = "history" -> null
        }
      ~ tags_all         = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-018f623a7e829f2b4"
      ~ tags             = {
            "Name"        = "prod-history-public"
          - "application" = "history" -> null
        }
      ~ tags_all         = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05cf1c203c88fa386"
      ~ tags                                           = {
            "Name"        = "prod-history-private-eu-central-1a"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0b32e43f9f425feec"
      ~ tags                                           = {
            "Name"        = "prod-history-private-eu-central-1b"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-09226556fd9b1b1a4"
      ~ tags                                           = {
            "Name"        = "prod-history-private-eu-central-1c"
            "Visibility"  = "private"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-01ebbeab3a2cb9086"
      ~ tags                                           = {
            "Name"        = "prod-history-public-eu-central-1a"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-062389591aadc0473"
      ~ tags                                           = {
            "Name"        = "prod-history-public-eu-central-1b"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-030e5c8360518bf8b"
      ~ tags                                           = {
            "Name"        = "prod-history-public-eu-central-1c"
            "Visibility"  = "public"
          - "application" = "history" -> null
        }
      ~ tags_all                                       = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (5 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-02b02d7ebf64d7699"
      ~ tags                                 = {
            "Name"        = "prod-history"
          - "application" = "history" -> null
        }
      ~ tags_all                             = {
          + "Application" = "history"
          - "application" = "history" -> null
            # (4 unchanged elements hidden)
        }
        # (16 unchanged attributes hidden)
    }

Plan: 4 to add, 34 to change, 1 to destroy.

Changes to Outputs:
  ~ version = "0.9.7" -> "0.9.8"
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.monitoring.grafana_data_source.prometheus has been deleted%0A  - resource "grafana_data_source" "prometheus" {%0A        id                 = "137"%0A        name               = "walletconnect-eu-central-1-prod-history-amp"%0A      - uid                = "cIjCUqf4k" -> null%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # aws_prometheus_workspace.prometheus will be updated in-place%0A  ~ resource "aws_prometheus_workspace" "prometheus" {%0A        id                  = "ws-29641597-9b6a-44dd-9f05-e48a94e51f9c"%0A      ~ tags                = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all            = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.dns.aws_acm_certificate.domain_certificate will be updated in-place%0A  ~ resource "aws_acm_certificate" "domain_certificate" {%0A        id                        = "arn:aws:acm:eu-central-1:898587786287:certificate/5030302f-c887-4743-909b-76e57f844a3c"%0A      ~ tags                      = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                  = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_cloudwatch_log_group.cluster_logs will be updated in-place%0A  ~ resource "aws_cloudwatch_log_group" "cluster_logs" {%0A        id                = "walletconnect-prod-history_logs"%0A        name              = "walletconnect-prod-history_logs"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_cluster.app_cluster will be updated in-place%0A  ~ resource "aws_ecs_cluster" "app_cluster" {%0A        id                 = "arn:aws:ecs:eu-central-1:898587786287:cluster/walletconnect-prod-history"%0A        name               = "walletconnect-prod-history"%0A      ~ tags               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (2 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/walletconnect-prod-history/walletconnect-prod-history-service"%0A        name                               = "walletconnect-prod-history-service"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:12" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/walletconnect-prod-history:12" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "walletconnect-prod-history" -> (known after apply)%0A      ~ revision                 = 12 -> (known after apply)%0A      - tags                     = {%0A          - "application" = "history"%0A        } -> null%0A      ~ tags_all                 = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_iam_policy.otel will be updated in-place%0A  ~ resource "aws_iam_policy" "otel" {%0A        id        = "arn:aws:iam::898587786287:policy/walletconnect-prod-history-otel"%0A        name      = "walletconnect-prod-history-otel"%0A      ~ tags      = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all  = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_iam_role.ecs_task_execution_role will be updated in-place%0A  ~ resource "aws_iam_role" "ecs_task_execution_role" {%0A        id                    = "walletconnect-prod-history-ecs-task-execution-role"%0A        name                  = "walletconnect-prod-history-ecs-task-execution-role"%0A      ~ tags                  = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all              = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_lb.application_load_balancer will be updated in-place%0A  ~ resource "aws_lb" "application_load_balancer" {%0A        id                               = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/app/walletconnect-prod-history/c55de72490c4a039"%0A        name                             = "walletconnect-prod-history"%0A      ~ tags                             = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                         = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (18 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener will be updated in-place%0A  ~ resource "aws_lb_listener" "listener" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-prod-history/c55de72490c4a039/e44bb46ef00b8a6a"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_listener.listener-http will be updated in-place%0A  ~ resource "aws_lb_listener" "listener-http" {%0A        id                = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/app/walletconnect-prod-history/c55de72490c4a039/b41fd393390c353e"%0A      ~ tags              = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all          = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.ecs.aws_lb_target_group.target_group will be updated in-place%0A  ~ resource "aws_lb_target_group" "target_group" {%0A        id                                 = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/walletconnect-prod-history/78b4a2bb7695306a"%0A        name                               = "walletconnect-prod-history"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_security_group.app_ingress will be updated in-place%0A  ~ resource "aws_security_group" "app_ingress" {%0A        id                     = "sg-0b43a03722dabc0da"%0A        name                   = "walletconnect-prod-history-ingress-to-app"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_security_group.lb_ingress will be updated in-place%0A  ~ resource "aws_security_group" "lb_ingress" {%0A        id                     = "sg-0b720bcf5e84babae"%0A        name                   = "walletconnect-prod-history-lb-ingress"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_cluster.docdb_primary will be updated in-place%0A  ~ resource "aws_docdb_cluster" "docdb_primary" {%0A        id                              = "walletconnect-prod-history-history-db-primary"%0A      ~ tags                            = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                        = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (24 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_cluster_instance.docdb_instances[0] will be updated in-place%0A  ~ resource "aws_docdb_cluster_instance" "docdb_instances" {%0A        id                           = "walletconnect-prod-history-history-db-primary-instance-0"%0A      ~ tags                         = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                     = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (20 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_docdb_subnet_group.private_subnets will be updated in-place%0A  ~ resource "aws_docdb_subnet_group" "private_subnets" {%0A        id          = "walletconnect-prod-history-history-db-private-subnet-group"%0A        name        = "walletconnect-prod-history-history-db-private-subnet-group"%0A      ~ tags        = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all    = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_kms_key.docdb_encryption will be updated in-place%0A  ~ resource "aws_kms_key" "docdb_encryption" {%0A        id                                 = "2376630b-ad46-4e6d-900c-a03c76e6eb84"%0A      ~ tags                               = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                           = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_secretsmanager_secret.master_password will be updated in-place%0A  ~ resource "aws_secretsmanager_secret" "master_password" {%0A        id                             = "arn:aws:secretsmanager:eu-central-1:898587786287:secret:walletconnect-prod-history-history-db-master-password-kQ0JMy"%0A        name                           = "walletconnect-prod-history-history-db-master-password"%0A      ~ tags                           = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.history_docdb.aws_security_group.service_security_group will be updated in-place%0A  ~ resource "aws_security_group" "service_security_group" {%0A        id                     = "sg-0b20ecc25cab21283"%0A        name                   = "walletconnect-prod-history-history-db-service"%0A      ~ tags                   = {%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.monitoring.data.jsonnet_file.dashboard will be read during apply%0A  # (config refers to values not yet known)%0A <= data "jsonnet_file" "dashboard" {%0A      + ext_str  = {%0A          + "dashboard_title" = "prod - history"%0A          + "dashboard_uid"   = "prod-history"%0A          + "prometheus_uid"  = (known after apply)%0A        }%0A      + id       = (known after apply)%0A      + rendered = (known after apply)%0A      + source   = "monitoring/dashboard.jsonnet"%0A    }%0A%0A  # module.monitoring.grafana_dashboard.main will be created%0A  + resource "grafana_dashboard" "main" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-prod-history-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.monitoring.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + manageAlerts  = false%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "ec2_iam_role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "walletconnect-eu-central-1-prod-history-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-29641597-9b6a-44dd-9f05-e48a94e51f9c/"%0A    }%0A%0A  # module.vpc.aws_default_network_acl.this[0] will be updated in-place%0A  ~ resource "aws_default_network_acl" "this" {%0A        id                     = "acl-09bb771bb1760d7fc"%0A      ~ tags                   = {%0A            "Name"        = "prod-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.vpc.aws_default_route_table.default[0] will be updated in-place%0A  ~ resource "aws_default_route_table" "default" {%0A        id                     = "rtb-046a3d3232d8b3613"%0A      ~ tags                   = {%0A            "Name"        = "prod-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.vpc.aws_default_security_group.this[0] will be updated in-place%0A  ~ resource "aws_default_security_group" "this" {%0A        id                     = "sg-024a8de0536ce595b"%0A        name                   = "default"%0A      ~ tags                   = {%0A            "Name"        = "prod-history-default"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all               = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (7 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_eip.nat[0] will be updated in-place%0A  ~ resource "aws_eip" "nat" {%0A        id                   = "eipalloc-0e4c3e984dd851e98"%0A      ~ tags                 = {%0A            "Name"        = "prod-history-eu-central-1a"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (11 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_internet_gateway.this[0] will be updated in-place%0A  ~ resource "aws_internet_gateway" "this" {%0A        id       = "igw-092684c3f9ff22731"%0A      ~ tags     = {%0A            "Name"        = "prod-history"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_nat_gateway.this[0] will be updated in-place%0A  ~ resource "aws_nat_gateway" "this" {%0A        id                   = "nat-013632d6acdc19f3c"%0A      ~ tags                 = {%0A            "Name"        = "prod-history-eu-central-1a"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.private[0] will be updated in-place%0A  ~ resource "aws_route_table" "private" {%0A        id               = "rtb-009d6aead2afe5310"%0A      ~ tags             = {%0A            "Name"        = "prod-history-private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all         = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_route_table.public[0] will be updated in-place%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-018f623a7e829f2b4"%0A      ~ tags             = {%0A            "Name"        = "prod-history-public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all         = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[0] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-05cf1c203c88fa386"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-private-eu-central-1a"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[1] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-0b32e43f9f425feec"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-private-eu-central-1b"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.private[2] will be updated in-place%0A  ~ resource "aws_subnet" "private" {%0A        id                                             = "subnet-09226556fd9b1b1a4"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-private-eu-central-1c"%0A            "Visibility"  = "private"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[0] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-01ebbeab3a2cb9086"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-public-eu-central-1a"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[1] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-062389591aadc0473"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-public-eu-central-1b"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_subnet.public[2] will be updated in-place%0A  ~ resource "aws_subnet" "public" {%0A        id                                             = "subnet-030e5c8360518bf8b"%0A      ~ tags                                           = {%0A            "Name"        = "prod-history-public-eu-central-1c"%0A            "Visibility"  = "public"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                                       = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (5 unchanged elements hidden)%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # module.vpc.aws_vpc.this[0] will be updated in-place%0A  ~ resource "aws_vpc" "this" {%0A        id                                   = "vpc-02b02d7ebf64d7699"%0A      ~ tags                                 = {%0A            "Name"        = "prod-history"%0A          - "application" = "history" -> null%0A        }%0A      ~ tags_all                             = {%0A          + "Application" = "history"%0A          - "application" = "history" -> null%0A            # (4 unchanged elements hidden)%0A        }%0A        # (16 unchanged attributes hidden)%0A    }%0A%0APlan: 4 to add, 34 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  ~ version = "0.9.7" -> "0.9.8"%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*